# Bootstrap tool — must stay in Homebrew so it can manage everything else
brew "chezmoi"

{{- if eq .chezmoi.os "darwin" }}

# Newer bash (macOS ships 3.2.x)
brew "bash"

# System networking
brew "iproute2mac"

# Developer tools that must stay in Homebrew
brew "dotnet"
brew "openvpn"

# macOS-specific utilities
brew "age-plugin-se"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-monaspace"
cask "font-sf-mono-nerd-font-ligaturized"

# Security
cask "1password-cli"
cask "git-credential-manager"
cask "keepassxc"

# GUI applications
cask "bruno"
cask "qlmarkdown"
cask "raycast"
cask "visual-studio-code"

{{- if dig "machine" "personal" false . }}
# Virtualization (personal lab only)
brew "qemu"
brew "vde"

# Database servers (personal dev only — work machines use remote DBs)
brew "postgresql@14"
brew "mysql"

# Security scanning (brew services)
brew "clamav"

# Security monitoring
cask "knockknock"
cask "osquery"
cask "taskexplorer"

# Personal GUI applications
cask "claude-code"
cask "cmux"
cask "packetsender"
cask "wireshark-app"
{{- else }}
# PostgreSQL client for connecting to remote databases
brew "postgresql@15"
{{- end }}

# AWS
cask "copilot-cli"

# VSCode extensions — managed via Homebrew Bundle on macOS
# Universal (installed on all machines)
vscode "astral-sh.ty"
vscode "azurite.azurite"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bruno-api-client.bruno"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "earshinov.permute-lines"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "jetpack-io.devbox"
vscode "mechatroner.rainbow-csv"
vscode "mkhl.direnv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "nefrob.vscode-just-syntax"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"

{{- if dig "machine" "personal" false . }}
# Personal VSCode extensions
vscode "anthropic.claude-code"
vscode "compilenix.vscode-zonefile"
vscode "darkriszty.markdown-table-prettify"
vscode "dnicolson.binary-plist"
vscode "dnut.rewrap-revived"
vscode "fmoronzirfas.open-in-marked"
vscode "golang.go"
vscode "jnoortheen.nix-ide"
vscode "kenhowardpdx.vscode-gist"
vscode "mathcale.theme-dracula-refined"
vscode "mitchdenny.ecdc"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "parallelsdesktop.parallels-desktop"
vscode "platformio.platformio-ide"
vscode "thenuprojectcontributors.vscode-nushell-lang"
{{- else }}
# Work VSCode extensions
vscode "1password.op-vscode"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-footnotes"
vscode "chrisdias.promptboost"
vscode "dracula-theme.theme-dracula"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.hcl"
vscode "hediet.vscode-drawio"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-server"
vscode "sourcegraph.sourcegraph"
# Java development
vscode "redhat.java"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
{{- end }}

{{- if dig "cloud" "aws" false . }}
# AWS VSCode extension
vscode "amazonwebservices.aws-toolkit-vscode"
{{- end }}

{{- end }}

{{- if dig "development" "docker" false . }}
# Container tools
brew "podman"
brew "podman-compose"
{{- if eq .chezmoi.os "darwin" }}
cask "podman-desktop"
{{- end }}
{{- end }}

{{- if dig "cloud" "azure" false . }}
# Azure tools (Homebrew per Microsoft's recommendations)
tap "azure/functions"
tap "azure/kubelogin"
brew "azure-cli"
brew "azcopy"
brew "aztfexport"
brew "azure/functions/azure-functions-core-tools@4"
brew "azure/kubelogin/kubelogin"
{{- end }}

{{- if dig "tools" "terraform" false . }}
# HashiCorp tools (Homebrew for proper macOS integration)
tap "hashicorp/tap"
brew "hashicorp/tap/vault"
tap "minamijoyo/hcledit"
brew "minamijoyo/hcledit/hcledit"
{{- end }}

{{- if dig "cloud" "gcloud" false . }}
# Google Cloud tools
cask "google-cloud-sdk"
{{- end }}

{{- if dig "cloud" "aws" false . }}
# AWS tools
brew "awscli"
{{- end }}

{{- if dig "development" "kubernetes" false . }}
# Kubernetes tools not available in nixpkgs on macOS
brew "calicoctl"
{{- if eq .chezmoi.os "darwin" }}
tap "fairwindsops/tap"
brew "fairwindsops/tap/pluto"
cask "lens"
{{- end }}
{{- end }}

{{- if dig "tools" "sdr" false . }}
# SDR / hardware driver stack
{{- if eq .chezmoi.os "darwin" }}
brew "airspy"
brew "airspyhf"
brew "esptool"
brew "f3"
brew "hackrf"
brew "soapyrtlsdr"
brew "soapysdr"
{{- end }}
{{- end }}
